"""
Варіант 8

Задача №1: Напишіть програму, яка запропонує користувачеві ввести десяткове число у межах від 1 до 10. Програма повинна вивести версію римського числа. Програма має враховувати ситуацію, якщо введене число є за межами діапазону від 1 до 10.
Автор: Гладкович Ярослав
"""

# Запит користувача ввести число від 1 до 10
print("Введіть число від 1 до 10")

# Зчитування введеного користувачем числа
number = int(input("Введіть число: "))

# Функція для перетворення десяткового числа у римське
def decimal_to_roman(n):
    # Перевірка чи число знаходиться у межах від 1 до 10
    if n < 1 or n > 10:
        return "Помилка"
    else:
        # Створення словника з римськими числами для відповідних десяткових чисел
        roman_numerals = {1: 'I', 2: 'II', 3: 'III', 4: 'IV', 5: 'V', 6: 'VI', 7: 'VII', 8: 'VIII', 9: 'IX', 10: 'X'}
        return roman_numerals[n]

# Виведення результату перетворення числа у римське
print(decimal_to_roman(number))
