"""
Варіант 8

Задача №2: Шаховий король ходить по горизонталі, вертикалі і діагоналі, але тільки на 1 клітинку. Дано дві різні клітинки шахової дошки, визначте, чи може король потрапити з першої клітинки на другу за один хід. Програма отримує на вхід чотири числа від 1 до 8 кожне, що задають номер стовпця і номер рядка спочатку для першої клітинки, потім для другої клітинки. Програма повинна вивести Yes, якщо з першої клітинки ходом короля можна потрапити в другу або No в іншому випадку.
Автор: Гладкович Ярослав
"""
def can_king_reach(x1, y1, x2, y2):
	# Перевіряє чи різниця між x-координатами і y-координатами менше або дорівнює 1
	if abs(x2 - x1) <= 1 and abs(y2 - y1) <= 1:
		return "Так"
	else:
		return "Ні"

# Просить користувача ввести чотири числа від 1 до 8, які є координатами двох клітинок
x1, y1, x2, y2 = map(int, input("Введіть координати двох клітинок: ").split())

# Перевірка чи король може досягти другої клітинки з першої
print(can_king_reach(x1, y1, x2, y2))